app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
    @questions = Question.where(:category_id => @category.id).paginate(:per_page => 10, :page => params[:page])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
SELECT "questions".* FROM "questions" WHERE ("questions"."category_id" = 1) LIMIT 10 OFFSET 0