app/controllers/membres_controller.rb

  def index
    @users = User.order("points desc").paginate(:per_page => 50, :page => params[:page])
---
SELECT "users".* FROM "users" ORDER BY points desc LIMIT 50 OFFSET 0