app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 1) LIMIT 1
---
  def show
    @question = Question.find(params[:id])

SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 1) LIMIT 1
---
  def reponse
    question = Question.find(params[:question_id])