app/views/categories/index.html.erb

SELECT COUNT(*) FROM "questions" WHERE ("questions".category_id = 1)
---
  <td><%= link_to category.libelle, category %></td>
  <td><%= pluralize(category.questions.count, 'question', 'questions') %></td>